tutorials/FSI/ampFsiFoam/3dTube/fluid/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      flowProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidPatch inner-wall;
solidZone inner-wall-zone;

fluidPatch wall;
fluidZone wall-zone;

outerCorrTolerance 1e-6;
nOuterCorr 1;

coupled yes;
predictor yes;



// irrelevant parameters

relaxationFactor 0.05;
interfaceDeformationLimit 0;

interpolatorUpdateFrequency 0;

//couplingScheme FixedRelaxation;
//couplingScheme Aitken;
couplingScheme IQN-ILS;
couplingReuse 1;


// ************************************************************************* //
